application/dst_sts/backend/controllers/AccountController.php

INSERT INTO `account` (`acounttype`, `accountusername`, `accountpassword`, `accountdateregistered`, `accountstatus`, `instructor_id`, `admin_id`) VALUES ('Instructor', 'bqcruz', 'nash619', '2015-03-07', 'Testing', 1, 1)
---
    public function actionCreate()
    {
        $model = new Account();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {